# LargeFamilyFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..LargeFamilyFile Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Family occupies XXX kilobytes of memory. Consider simplification of the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LargeFamilyFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LargeFamilyFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LargeFamilyFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace